# -*- coding: utf-8 -*-
# @Time : 2020/11/19
# @Author : Benny Jane
# @Email : 暂无
# @File : profile.py
# @Project : career-planning-info

"""
=======================================================================================================================
目标工作
=======================================================================================================================
"""

TARGET_JOB = {
    "name": "Python工程师(web|数据处理|可视化)",
    "skills": [
        "熟练掌握Python编程",
        "熟练Pandas处理数据，以及Echarts的使用",
        "熟练使用Flask框架",
        "完成superset开源项目二次开发",
        "熟悉缓存、消息队列、定时任务等相关技术",

        # "熟悉Python的多线程,多进程编程",
        # "熟悉常用的数据结构、算法和设计模式等",
    ],
}

"""
=======================================================================================================================
个人项目信息
=======================================================================================================================
"""
PROJECTS = [
    {
        "name": "Flask-Demo",
        "brief": "Python方向招聘信息展示项目, 抓取招聘网站信息，进行可视化展示，并提供了原始数据下载",
        "url": "https://github.com/BennyJane/career-planning-info",
        "icon": ""
    },
    {
        "name": "Flask-Demo",
        "brief": "总结Flask框架常用的功能模块",
        "url": "https://github.com/BennyJane/Flask-Demo",
        "icon": ""
    },

]
