# !/usr/bin/env python
# -*-coding:utf-8 -*-
# PROJECT    : career-planning-info
# Time       ：2020/12/15 22:21
# Warning    ：The Hard Way Is Easier
from collections import namedtuple

# 网站角色信息
role = namedtuple("role", "name email avatar role")
ROLE_INFO = [
    role("Benny Jane", "123456@qq.com", "", True),
    role("Admin", "123456@qq.com", "", True),
    role("Visitor", "", "", False),
]

# "倚天屠龙记"
USER_NAME = ['卜泰', '丁敏尹', '马法通', '卫天望', '卫四娘', '小翠', '小虹', '乌旺阿普', '小凤', '小昭', '卫璧', '王难姑', '元广波', '邓愈', '方天劳', '天鸣方丈',
             '韦一笑', '云鹤', '无色', '王八衰', '方东白', '五姑', '贝锦仪', '无相禅师', '小玲', '王保保', '太虚子', '史镖头', '史火龙', '史红石', '平等宝树王',
             '叶长青', '孙三毁', '白龟寿', '陈友谅', '冷谦', '汤和', '朱元璋', '传功长老', '祁天彪', '纪晓芙', '朱长龄', '西华子', '刘敖', '阳顶天', '齐心宝树王',
             '李四摧', '过三拳', '李天恒', '刚相', '朱九真', '乔福', '苏梦清', '司徒千钟', '季长老', '花云', '吴良', '吴祯', '张无忌', '麦鲸', '何足道',
             '执法长老', '杜百当', '杨逍', '辛然', '妙风使', '邵鹤', '邵燕', '吴劲草', '寿南山', '吴六破', '张中', '何太冲', '孟正鸿', '灵虚', '宋青书', '张三丰',
             '阿二', '阿三', '杨不悔', '杨姐姐', '宋远桥', '张松溪', '张翠山', '苏习之', '麦少帮主', '周芷若', '郑长老', '宗维侠', '范遥', '拨速台', '周颠',
             '空闻', '空智', '空性', '空见', '空性', '周五输', '郑七灭', '明月', '武青婴', '金花婆婆', '武烈', '易三娘', '说不得', '胡青牛', '泉建男', '郝密',
             '闻苍松', '哈总管', '觉远', '赵敏', '赵一伤', '封坛主', '贺老三', '郭襄', '宫九佳', '欧阳牧之', '姚清泉', '胡青羊', '俞连舟', '俞岱岩', '都大锦',
             '徐达', '唐洋', '高老者', '圆真（成昆）', '唐文亮', '高则成', '流云使', '俱明宝树王', '夏胄', '圆业', '圆心', '钱二败', '殷野王', '殷天正', '殷无禄',
             '殷无福', '殷无寿', '殷离', '班淑娴', '殷素素', '殷梨亭', '莫声谷', '常敬之', '常遇春', '常胜宝树王', '渡劫', '渡难', '渡厄', '常金鹏', '清风',
             '鹿杖客', '韩林儿', '掌棒龙头', '彭莹玉', '谢逊', '蒋涛', '辉月使', '程坛主', '韩千叶', '矮老者', '掌钵龙头', '简捷', '詹春', '静空', '静照', '静迦',
             '静慧', '庄铮', '秦老五', '察罕特穆尔', '鲜于通', '德成', '潘天耕', '颜恒', '鹤笔翁', '薛公远', '圆音', '静虚师太', '静玄师太', '摩诃巴思', '灭绝师太']

MESSAGE_BRIEF = {
    "title": "碎碎念",
    "brief": "",
    "message_goal": "开放留言板块的目的",
}

NOTIFY_NEW_MESSAGE_TEMPLATE = "<font color='comment'>[career-planning-info]</font>-新增留言： \n" \
                              "<font color='comment'>body</font>: **{msg}** \n" \
                              "<font color='comment'>name</font>: {name} \n" \
                              "<font color='comment'>email</font>: {email} \n"



if __name__ == '__main__':
    print([i.strip() for i in USER_NAME.split()])
